#!/usr/bin/env bash
# Поиск по шаблону в операциях подстановки параметров # ## % %%.

var1=abcd12345abc6789
pattern1=a*c  # * (символ шаблона), означает любые символы между a и c

echo
echo "Script_name = $0"
echo "Число символов в ${var1} = ${#var1}" # Число символов в abcd12345abc6789 = 16
echo

echo "-= Поиск с начала строки, pattern1 подан как переменная =-"
echo "var1 = $var1"         # var1 = abcd12345abc6789
echo '${var1} =' "${var1}"  # ${var1} = abcd12345abc6789    (альтернативный вариант)
echo "pattern1 = $pattern1" # pattern1 = a*c   (между 'a' и 'c' могут быть любые символы)
echo
echo '${var1#$pattern1}  =' "${var1#$pattern1}"	    # ${var1#$pattern1} = d12345abc6789
# Наименьшая подстрока, удаляются первые 3 символа abcd12345abc6789
#                                 ^^^^^^           |---|
echo '${var1##$pattern1} =' "${var1##$pattern1}"    # ${var1##$pattern1} = 6789
# Наибольшая подстрока, удаляются первые 12 символов abcd12345abc6789
#                                 ^^^^^^            |------------|

echo
## эксперимент без переменной pattern1, паттерн подан напрямую
echo "-= Поиск с начала строки, pattern1 подан напрямую =-"
echo '${var1#$'$pattern1'}       =' "${var1#a*c}"   # ${var1#$a*c} = d12345abc6789
echo '${var1##$'$pattern1'}      =' "${var1##a*c}"  # ${var1##$a*c} = 6789
echo
echo "=========================================================="
echo

echo "-= Поиск с конца строки, pattern2 подан как переменная =-"
pattern2=b*9                # всё, что между 'b' и '9'
echo "var1 = $var1"         # var1 = abcd12345abc6789
echo "pattern2 = $pattern2"	# pattern2 = b*9
echo

echo '${var1%pattern2}   =' "${var1%$pattern2}"     # ${var1%pattern2} = abcd12345a
# Наименьшая подстрока, удаляются последние 6 символов abcd12345abc6789
#                                 ^^^^^^^^^                     |------|
echo '${var1%%pattern2}  =' "${var1%%$pattern2}"    # ${var1%%pattern2} = a
# Наибольшая подстрока, удаляются последние 15 символов abcd12345abc6789
#                                 ^^^^^^^^^             |---------------|
echo

# Запомните, # и ## используются для поиска с начала строки,
#            % и %% используются для поиска с конца строки.

## эксперимент без переменной pattern2, паттерн подан напрямую
echo "-= Поиск с конца строки, pattern2 подан напрямую =-"
echo '${var1%'$pattern2'}        =' "${var1%b*9}"   # ${var1%b*9} = abcd12345a
echo '${var1%%'$pattern2'}       =' "${var1%%b*9}"  # ${var1%%b*9} = a
echo

exit 0
